[
  {
    "company/agency": "The North Face",
    "description": "Warning: Fake North Face sites (e.g., 'northfaceblackfriday.shop') use fake deals to steal credit card info.",
    "how to spot it": "Verify URLs (no typos/odd extensions). Huge discounts or urgent language = red flag."
  },
  {
    "company/agency": "Nike",
    "description": "Alert: Instagram ads push fake Nike sites with huge discounts (e.g., 80% off) to steal payment info or send knock-offs.",
    "how to spot it": "Check profile/URL (must link to nike.com). Unbelievable deals are likely scams."
  },
  {
    "company/agency": "Amazon",
    "description": "Watch Out: Emails saying 'Amazon Order Hold' or 'Account Issue' link to fake logins to steal your credentials.",
    "how to spot it": "Check sender (must be @amazon.com). When unsure, log in directly via browser/app."
  },
  {
    "company/agency": "Walmart",
    "description": "Beware: Fake Walmart gift card giveaways on Facebook lead to scam survey sites stealing data or demanding fees.",
    "how to spot it": "Verify on official Walmart channels. Giveaways needing fees or too much info are red flags."
  },
  {
    "company/agency": "Chase",
    "description": "Alert: Texts like 'Chase: Unusual Activity' link to fake logins to steal your banking credentials.",
    "how to spot it": "Texts only from verified codes. Log in via official site/app, not unknown links."
  },
  {
    "company/agency": "Bank of America",
    "description": "Warning: Calls pretending to be BofA fraud team pressure you to transfer funds to a 'safe' (scammer's) account.",
    "how to spot it": "BofA never pressures fund transfers via phone. Hang up, call the official number on their site/your card."
  },
  {
    "company/agency": "Wells Fargo",
    "description": "Watch Out: Emails claiming 'Wells Fargo Account Locked' use fake links to steal your login info.",
    "how to spot it": "Check sender (@wellsfargo.com). Suspicious link? Log in directly on the official site."
  },
  {
    "company/agency": "PayPal",
    "description": "Alert: Emails warning 'PayPal Account Limitation' link to fake logins designed to steal your credentials.",
    "how to spot it": "Real emails use your name & come from PayPal addresses. Never click links; log in directly."
  },
  {
    "company/agency": "Microsoft",
    "description": "Warning: Fake 'Microsoft Virus' pop-ups demand you call 'support'. Calling leads to remote access scams/malware.",
    "how to spot it": "Real alerts are in OS/updates, not pop-ups forcing calls. Close pop-up, run trusted antivirus."
  },
  {
    "company/agency": "Apple",
    "description": "Beware: Calls claiming to be Apple Support about 'compromised iCloud' demand gift cards or fake app installs.",
    "how to spot it": "Apple never calls unsolicited or demands gift cards/app installs. Hang up, call official support."
  },
  {
    "company/agency": "Google",
    "description": "Alert: Fake Google recruiters on LinkedIn offer quick jobs via brief interviews to steal personal info.",
    "how to spot it": "Google hiring is thorough, not casual messages. Verify recruiters on official Google careers page."
  },
  {
    "company/agency": "Costco",
    "description": "Watch Out: Texts offering Costco WFH jobs demand fees for 'training/shipping', then vanish with your money.",
    "how to spot it": "Costco never texts job offers or asks for upfront fees. Verify offers via official Costco site."
  },
  {
    "company/agency": "Amazon",
    "description": "Beware: Emails offering Amazon remote jobs ask for 'training fees' or bank details upfront, then disappear.",
    "how to spot it": "Real Amazon jobs via careers portal; never require upfront payment. WFH jobs asking for money = red flag."
  },
  {
    "company/agency": "Army",
    "description": "Warning: Dating app scammers posing as deployed U.S. Army officers invent fake emergencies to ask for money.",
    "how to spot it": "Financial requests from unmet online contacts = red flag. Real military won't ask for cash on dating apps."
  },
  {
    "company/agency": "Facebook",
    "description": "Alert: Facebook Dating scammers (e.g., 'widowed engineer on oil rig') invent crises to ask you for money.",
    "how to spot it": "Match avoids video calls then asks for money = red flag. Verify identity via live chat first."
  },
  {
    "company/agency": "Coinbase",
    "description": "Beware: Dating app contacts brag of Coinbase crypto gains, push quick investments using fake dashboards.",
    "how to spot it": "High-pressure investment pitches from new online contacts = red flag. Don't let romance cloud judgment."
  },
  {
    "company/agency": "USPS",
    "description": "Watch Out: Texts claiming 'USPS Delivery Issue' demand small fees via links to fake sites that steal card info.",
    "how to spot it": "USPS never texts demanding immediate payment. Use official tracking or call post office."
  },
  {
    "company/agency": "FedEx",
    "description": "Alert: Emails about 'FedEx Missed Delivery' link to fake sites designed to steal personal/financial info.",
    "how to spot it": "Check sender (must be @fedex.com). Urgent email? Log in directly to FedEx site, don't click links."
  },
  {
    "company/agency": "IRS",
    "description": "Warning: Calls/emails pretending to be IRS demand immediate payment (gift card/wire) for fake back taxes.",
    "how to spot it": "IRS uses mail, never demands immediate electronic payment. Verify directly with IRS official contacts."
  },
  {
    "company/agency": "Xfinity",
    "description": "Watch Out: Emails claiming 'Xfinity Payment Failed' link to fake logins to steal credentials/billing info.",
    "how to spot it": "Check sender (official Xfinity address). Urgent email? Log in directly via site/app or call Xfinity."
  }
]
