[
  {
    "category": "romance",
    "description": "She thought she met the love of her life on a dating app — he said he was stationed overseas and messaged her every day for months. When he said he needed help covering a sudden medical emergency, she wired the money… and never heard from him again.",
    "how to spot it": "If someone you’ve never met keeps avoiding video calls or in-person visits, it’s a red flag. A real partner won’t ask you to send money to a stranger across the world.",
    "image": "https://cdn-icons-png.flaticon.com/512/1077/1077035.png"
  },
  {
    "category": "phishing",
    "description": "One woman got an urgent email that her bank account was locked — it looked exactly like the real thing. She clicked the link, logged in, and the next morning found her account drained.",
    "how to spot it": "If you get a scary email or text, don’t click anything — open the app or go straight to the official site instead. Scammers often copy logos and names, but the web address or email is slightly off.",
    "image": "https://cdn-icons-png.flaticon.com/512/634/634013.png"
  },
  {
    "category": "job",
    "description": "He was thrilled to land a remote job without an interview — they even ‘hired’ him the same day. But after sending $150 for a ‘background check,’ the company vanished and stopped replying.",
    "how to spot it": "If a job offer comes too easily and asks you to send money, hit pause. Real employers won’t ask you to pay out of pocket just to get started.",
    "image": "https://cdn-icons-png.flaticon.com/512/3063/3063826.png"
  },
  {
    "category": "shopping",
    "description": "She found a site selling designer shoes for half the price and placed an order — but weeks later, a cheap plastic keychain showed up instead. The website and customer support disappeared overnight.",
    "how to spot it": "If the price looks too good to be true, it probably is. Before buying, search for reviews and see how long the website’s been around.",
    "image": "https://cdn-icons-png.flaticon.com/512/1170/1170576.png"
  }
]
