[
  {
    "title": "Digital Decoy",
    "description": "A convincing phishing email disguised as a security alert from your bank or favorite service.",
    "details": "1. Look for unsolicited emails prompting urgent action; 2. Examine sender addresses for subtle typos or inconsistencies; 3. Verify account issues by accessing your account directly via official channels."
  },
  {
    "title": "Phantom Tech Rescue",
    "description": "Fake support agents posing as Microsoft or Apple reps to 'fix' a made-up virus.",
    "details": "1. Identify unsolicited tech support warnings or cold calls; 2. Notice unexpected requests for remote access; 3. Confirm warnings by checking official company contact details."
  },
  {
    "title": "Fortune Mirage",
    "description": "A too-good-to-be-true email claiming you've won a sweepstakes you never entered.",
    "details": "1. Check if the win notification is unexpected or unsolicited; 2. Notice if there's a demand for upfront fees to claim the prize; 3. Verify prize claims through official contest channels."
  },
  {
    "title": "Heartstrings Heist",
    "description": "A long-play romance con where emotional manipulation leads to financial ruin.",
    "details": "1. Notice if the relationship escalates unusually fast with emotional appeals; 2. Observe any unexpected requests for money from someone you haven’t met in person; 3. Verify profile image authenticity using reverse image searches."
  },
  {
    "title": "Job Mirage",
    "description": "A phony job offer that leads to identity theft or upfront 'training' fees.",
    "details": "1. Confirm company legitimacy via official websites; 2. Look out for job offers demanding upfront fees or payments; 3. Identify vague job descriptions or irregular interview practices."
  },
  {
    "title": "Clone Commerce",
    "description": "Fake online stores selling hot deals that never ship anything.",
    "details": "1. Check if the website uses HTTPS and has a verifiable domain history; 2. Observe if deals are suspiciously low-priced compared to market value; 3. Cross-check the store on review sites or scam alert forums."
  },
  {
    "title": "Grandkid Gambit",
    "description": "A high-pressure call from a 'grandchild' in distress, begging for emergency funds.",
    "details": "1. Notice urgent financial requests coming unexpectedly from a family member; 2. Verify the scenario by directly contacting the actual person involved; 3. Be cautious if the story demands secrecy or rapid action."
  },
  {
    "title": "Crypto Mirage",
    "description": "A fast-talking 'investor' promising massive crypto returns in no time.",
    "details": "1. Check if crypto investment proposals are unsolicited; 2. Notice promises of high or guaranteed returns; 3. Verify the legitimacy of investment platforms using regulated sources."
  }
]
