[
  {
    "category": "romance",
    "description": "Scammers are actively using Facebook Dating to impersonate U.S. Army Captains deployed overseas, claiming to be stuck in Syria or Kuwait. They spend weeks chatting, then claim they need help paying for emergency leave or a courier to send personal belongings.",
    "how to spot it": "If someone says they’re in the military and asks for money through Western Union or gift cards, it’s a scam. Real service members don’t pay to take leave or ship personal items.",
    "image": "https://cdn-icons-png.flaticon.com/512/1077/1077035.png"
  },
  {
    "category": "phishing",
    "description": "Scammers are sending fake emails and texts pretending to be from Amazon, saying there’s a problem with a recent order. The message links to a fake login page that looks real but is designed to steal your credentials.",
    "how to spot it": "Real Amazon emails come from addresses ending in @amazon.com — watch for slight variations like @amzon-support.com. If in doubt, go to Amazon directly instead of clicking any link.",
    "image": "https://cdn-icons-png.flaticon.com/512/634/634013.png"
  },
  {
    "category": "job",
    "description": "Scammers are impersonating Costco’s HR department, texting people about remote customer service jobs and asking them to move conversations to Telegram. After sending fake offer letters, they request payment for training software or equipment shipping.",
    "how to spot it": "Costco does not hire or communicate job offers through Telegram or ask applicants to pay for anything. Always apply through the official Costco Careers page.",
    "image": "https://cdn-icons-png.flaticon.com/512/3063/3063826.png"
  },
  {
    "category": "shopping",
    "description": "Fake ads on Facebook are promoting discounted Dyson Airwraps and Shark vacuums, linking to scam websites that mimic real retailers. Many victims report receiving knockoff items or nothing at all after payment.",
    "how to spot it": "Check the website URL carefully — scammers often use domains like dyson-clearance.shop or sharkdeals.store. If it’s not the official Dyson or Shark website, don’t enter your credit card info.",
    "image": "https://cdn-icons-png.flaticon.com/512/1170/1170576.png"
  }
]
