[
  {
    "category": "romance",
    "description": "A scammer builds a fake romantic relationship over weeks or months through dating apps or social media, claiming to be overseas for work or military service. Eventually, they create a fabricated emergency — like a medical bill or travel cost — and ask the victim to wire money or send gift cards. The scammer often vanishes after receiving the money, leaving the victim emotionally and financially devastated.",
    "how to spot it": "Be cautious if someone you’ve never met in person professes love quickly. Watch for stories that prevent in-person meetings and requests for money. Reverse image search their profile pictures to check for duplicates.",
    "image": "https://cdn-icons-png.flaticon.com/512/1077/1077035.png"
  },
  {
    "category": "phishing",
    "description": "A spoofed email or text appears to be from a trusted source — like a bank, Amazon, or the IRS — warning of suspicious account activity or missed payments. The message contains a link to a fake website that captures your login credentials or personal information. Some variants include malicious attachments that install spyware or ransomware.",
    "how to spot it": "Avoid clicking links in unexpected emails or texts. Check for slight misspellings in sender addresses and website URLs. Log in to your account through the official app or site instead of any provided links.",
    "image": "https://cdn-icons-png.flaticon.com/512/634/634013.png"
  },
  {
    "category": "job",
    "description": "Victims are offered remote jobs with high pay and flexible hours, often with no interview. After a fake onboarding, they're asked to purchase equipment or pay for background checks using their own money, with a promise of reimbursement. The scammer disappears once the payment is made.",
    "how to spot it": "Watch for job offers that skip standard hiring procedures. Be skeptical of any position requiring you to front costs. Research the company thoroughly and verify job postings through official sources.",
    "image": "https://cdn-icons-png.flaticon.com/512/3063/3063826.png"
  },
  {
    "category": "shopping",
    "description": "Scammers create fake e-commerce sites offering trendy or hard-to-find products at deep discounts. The sites may clone real brands, complete with logos and fake reviews, but orders are never fulfilled. Some victims report receiving unrelated junk items instead of what they ordered.",
    "how to spot it": "Compare prices — if it’s far below market value, be suspicious. Check if the site lacks real contact info or has broken pages. Look up reviews and domain history before buying.",
    "image": "https://cdn-icons-png.flaticon.com/512/1170/1170576.png"
  }
]
